let date = new Date();
let year = date.getFullYear();
let month = date.getMonth();
let day = date.getDate();

switch(month)
      {
        case 1:
          month="January";
          break;
        case 2:
          month="February";
          break;
        case 3:
          month="March";
          break;
        case 4:
          month="April";
          break;
        case 5:
          month="May";
          break;
        case 6:
          month="June";
          break;
        case 7:
          month="July";
          break;
        case 8:
          month="August";
          break;
        case 9:
          month="September";
          break;
        case 10:
          month="October";
          break;
        case 11:
          month="November";
          break;
        case 12:
          month="December";
          break;
        default:
          month="Invalid month";
      }

let showDate = `${day} / ${month} / ${year}`;

const dateDiv = document.getElementById('date');

dateDiv.innerHTML = showDate;


const moreInfo = document.querySelector(".more-info");
const title = document.querySelector('.all-title p');
const icon = document.querySelector('.all-title img');
const options = document.querySelectorAll('.options div');
const choosedep = document.querySelector('.intros h3');
const navigator = document.querySelector('.navigater');
const p = document.querySelector('.intros p');

let navCont = document.querySelectorAll(".nav-cont a");
let titles = document.querySelectorAll(".titles p");
let texts = document.querySelectorAll(".img-text p");
let imgs = document.querySelectorAll(".img-text img");


function texter(index) {
  navCont[1].innerText = objects[index].first.title;
  navCont[2].innerText = objects[index].second.title;
  navCont[3].innerText = objects[index].third.title;

  titles[0].innerText = objects[index].first.title;
  titles[1].innerText = objects[index].second.title;
  titles[2].innerText = objects[index].third.title;

  texts[0].innerText = objects[index].first.text;
  texts[1].innerText = objects[index].second.text;
  texts[2].innerText = objects[index].third.text;

  imgs[0].src = objects[index].first.url;
  imgs[1].src = objects[index].second.url;
  imgs[2].src = objects[index].third.url;
}


options[0].addEventListener('click', function () {
  navigator.style.display = "block";
  choosedep.style.display = "none";
  title.innerText = "زیبایی";
  icon.src = "Pics/icons/chin.png";
  p.innerHTML = "<b><sub>------</sub>بیمارستان تخصصی و فوق تخصصی گرگان</b> در زمینی به مساحت 27 هزار متر مربع و با زیربنای 8 هزار مترمربع در سال 1368 هجری شمسی پی ریزی گردید و در نهایت بیمارستان در سال 1381 هجری شمسی مورد بهره برداری قرار گرفت. این بیمارستان را مرحوم آیت الله حاج سید جواد آل علی شاهرودی قدس سره به نیت كسب رضایت حق و خدمت به خلق پی نهاد که ایشان پس از عمری خدمت و مجاهدت در سال 1377 در سن 69 سالگی به دیدار معبود شتافتند. این مركز در ابتدا با 50 تخت شروع به فعالیت نمود ولی با ساخت و افتتاح بخش ها و واحدهای جدید حالا زیربنایی بالغ بر شصت هزار متر مربع دارد و در حال حاضر دارای 300 تخت فعال بستری میباشد و در آینده نزدیک تعداد تخت های بستری بیمارستان به 400 تخت خواهد رسید.بيش از يك هزار پزشك در 70 رشته تخصصي و فوق تخصصي به صورت مستقيم با بيمارستان پيامبران همكاري دارند. همچنین بيش از 400 پرستار و ماماي با تجربه و بيش از 800 پرسنل اداري در اين بيمارستان گرد هم آمده اند تا بهترين خدمت ممكن را به مراجعان ارائه دهند. همچنین این مجموعه ی عظیم در کنار خدمات ارائه خدمات جامع درمانی و پایش سلامت دارای مجموعه رفاهی خدماتی در بالاترین سطح استاندارد های بین المللی برای ارائه خدمات به مراجعین شهرهای دیگر ایران و مهمانان خارجی می باشد .از آن جمله می توان به هتل 5 ستاره ، مجموعه آبی درمانی ، مجموعه ورزش و سالن بدنسازی و GYM ، سالن ورزش های توپی ، تالار بین المللی همایش های ، سالن پذیرایی ، سالن کنفرانس ، مجموعه آموزش و پارکینگ اختصاصی برای مراجعین اشاره نمود. همچنین این مجموعه برای اولین بار در ایران به راه اندازی مرکز چکاپ و پایش سلامت در سطح بین المللی و با آخرین استاندارد های جهانی نموده است.";
  moreInfo.style.display = "block";

  texter(8);
})

options[1].addEventListener('click', function () {
  navigator.style.display = "block";
  choosedep.style.display = "none";
  title.innerText = "جراحی";
  icon.src = "Pics/icons/surgery.png";
  p.innerHTML = "<b><sub>------</sub>تاریخچه بیمارستان گرگان </b> بیمارستان تخصصی و فوق تخصصی پیامبران در زمینی به مساحت 27 هزار متر مربع و با زیربنای 8 هزار مترمربع در سال 1368 هجری شمسی پی ریزی گردید و در نهایت بیمارستان در سال 1381 هجری شمسی مورد بهره برداری قرار گرفت. این بیمارستان را مرحوم آیت الله حاج سید جواد آل علی شاهرودی قدس سره به نیت كسب رضایت حق و خدمت به خلق پی نهاد که ایشان پس از عمری خدمت و مجاهدت در سال 1377 در سن 69 سالگی به دیدار معبود شتافتند. این مركز در ابتدا با 50 تخت شروع به فعالیت نمود ولی با ساخت و افتتاح بخش ها و واحدهای جدید حالا زیربنایی بالغ بر شصت هزار متر مربع دارد و در حال حاضر دارای 250  تخت فعال بستری میباشد و در آینده نزدیک تعداد تخت های بستری بیمارستان به 400 تخت خواهد رسید.بيش از يك هزار پزشك در 70 رشته تخصصي و فوق تخصصي به صورت مستقيم با بيمارستان پيامبران همكاري دارند. همچنین بيش از 400 پرستار و ماماي با تجربه و بيش از 800 پرسنل اداري در اين بيمارستان گرد هم آمده اند تا بهترين خدمت ممكن را به مراجعان ارائه دهند. همچنین این مجموعه ی عظیم در کنار خدمات ارائه خدمات جامع درمانی و پایش سلامت دارای مجموعه رفاهی خدماتی در بالاترین سطح استاندارد های بین المللی برای ارائه خدمات به مراجعین شهرهای دیگر ایران و مهمانان خارجی می باشد . از آن جمله می توان به هتل 5 ستاره ، مجموعه آبی درمانی ، مجموعه ورزش و سالن بدنسازی و GYM ، سالن ورزش های توپی ، تالار بین المللی همایش های ، سالن پذیرایی ، سالن کنفرانس ، مجموعه آموزش و پارکینگ اختصاصی برای مراجعین اشاره نمود. همچنین این مجموعه برای اولین بار در ایران به راه اندازی مرکز چکاپ و پایش سلامت در سطح بین المللی و با آخرین استاندارد های جهانی نموده است. ";
  moreInfo.style.display = "block";

  texter(0);
})

options[2].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "چشم پزشکی";
    icon.src = "Pics/icons/eye.png";
    moreInfo.style.display = "block";
    p.innerHTML = "<b><sub>------</sub>تاریخچه بیمارستان گرگان </b> بیمارستان تخصصی و فوق تخصصی پیامبران در زمینی به مساحت 27 هزار متر مربع و با زیربنای 8 هزار مترمربع در سال 1368 هجری شمسی پی ریزی گردید و در نهایت بیمارستان در سال 1381 هجری شمسی مورد بهره برداری قرار گرفت. این بیمارستان را مرحوم آیت الله حاج سید جواد آل علی شاهرودی قدس سره به نیت كسب رضایت حق و خدمت به خلق پی نهاد که ایشان پس از عمری خدمت و مجاهدت در سال 1377 در سن 69 سالگی به دیدار معبود شتافتند. این مركز در ابتدا با 50 تخت شروع به فعالیت نمود ولی با ساخت و افتتاح بخش ها و واحدهای جدید حالا زیربنایی بالغ بر شصت هزار متر مربع دارد و در حال حاضر دارای 250  تخت فعال بستری میباشد و در آینده نزدیک تعداد تخت های بستری بیمارستان به 400 تخت خواهد رسید.بيش از يك هزار پزشك در 70 رشته تخصصي و فوق تخصصي به صورت مستقيم با بيمارستان پيامبران همكاري دارند. همچنین بيش از 400 پرستار و ماماي با تجربه و بيش از 800 پرسنل اداري در اين بيمارستان گرد هم آمده اند تا بهترين خدمت ممكن را به مراجعان ارائه دهند. همچنین این مجموعه ی عظیم در کنار خدمات ارائه خدمات جامع درمانی و پایش سلامت دارای مجموعه رفاهی خدماتی در بالاترین سطح استاندارد های بین المللی برای ارائه خدمات به مراجعین شهرهای دیگر ایران و مهمانان خارجی می باشد . از آن جمله می توان به هتل 5 ستاره ، مجموعه آبی درمانی ، مجموعه ورزش و سالن بدنسازی و GYM ، سالن ورزش های توپی ، تالار بین المللی همایش های ، سالن پذیرایی ، سالن کنفرانس ، مجموعه آموزش و پارکینگ اختصاصی برای مراجعین اشاره نمود. همچنین این مجموعه برای اولین بار در ایران به راه اندازی مرکز چکاپ و پایش سلامت در سطح بین المللی و با آخرین استاندارد های جهانی نموده است. ";
    p.style.paddingBottom = "40px";
    
    texter(1);
  })

options[3].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "مراقبت";
    icon.src = "Pics/icons/cardiogram.png";
    p.innerHTML = "<b>ما برآنیم تا در سال 1402: </b><ul><br><li>به عنوان خوشنام ترین بیمارستان ارائه دهنده مراقبت‌های درمانی با بالاترین استانداردها به بیماران، شناخته شویم. </li><li>به عنوان پیشتاز استفاده از فناوری‌های نوین در خدمات درمانی شناخته شویم.     </li><li>به‌عنوان موفق‌ترین مركز درزمینه‌ی كاهش‌عفونت‌های بیمارستانی دربیمارستان‌های‌سطح كشورشناخته شویم.     </li><li>به عنوان برترین بیمارستان در بین بیمارستان‌های بخش خصوصی در جهت دوستدار ایمنی شناخته شویم.    </li></ul>";
    moreInfo.style.display = "block";
    
    texter(2);
})

options[4].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "داروخانه";
    icon.src = "Pics/icons/drugs.png";
    p.innerHTML = "بيمار محوري: ما بيمار را به عنوان مهم ترين سرمايه بيمارستان خود  در نظر مي‌گيريم.<br><br>تعالي مستمر: ما اشتياق فراوان به انجام امور در بالاترين سطح كيفيت داريم و همواره در مسير رشد حركت مي‌كنيم.<br><br>رعايت حقوق گيرندگان خدمت: ما خود را متعهد به رعايت كامل حقوق گيرندگان خدمت مي‌دانيم.<br><br>آموزش مداوم: ما خود را متعهد به آموزش مداوم نيروهاي انساني شاغل در بيمارستان مي‌دانيم.<br><br>مديريت خطر و حفظ ايمني بيمار: ما خود را متعهد به نهادينه ساختن مديريت خطر و حفظ ايمني بيمار مي‌دانيم.<br><br>محترم دانستن محيط زيست: ما احترام به محيط زيست و حفاظت از آن را وظيفه خود مي‌دانيم.<br><br>همدلي و مشاركت  جويي: ما همواره با مشاركت كاركنان و همدلي با بيماران درمسير   بهبود مستمر كيفيت  گام بر مي‌داريم.";
    moreInfo.style.display = "block";
    
    texter(3);
})

options[5].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "فیزیوتراپی";
    icon.src = "Pics/icons/physiotherapy.png";
    p.innerHTML = "<sub>------</sub>تعرفه های بیمارستان پیامبران کاملا براساس تعرفه های قانونی کشور است و هیچ وجه اضافه ای از بیماران دریافت نمی شود    بیمارستان پیامبران با هدف فراهم آوردن بهترین و با کیفیت ترین خدمات پزشکی با مناسب ترین قیمت احداث شده است و در راستای انجام این رسالت خود را ملزم به ارائه با کیفیت ترین خدمات درمانی می داند.     بیمارستان پیامبران به سلامت روحی و جسمی شما اهمیت می دهد. برای ما آرامش ، آسایش و ایمنی شما مهم است و خود را ملزم به رعایت تمام قوانین و احکام ملی و مذهبی می دانیم .     بیش از یک هزار پزشک در 70 رشته تخصصی و فوق تخصصی به صورت مستقیم با بیمارستان پیامبران همکاری دارند. بیش از سیصد پرستار و مامای با تجربه و بیش از پانصد پرسنل اداری و خدماتی در این بیمارستان گرد هم آمده اند تا بهترین خدمات ممکن را به مراجعان ارائه دهند.    وظیفه ما احترام گذاشتن به شما است . کلیه پرسنل بیمارستان باید بهترین رفتار را با کلیه مراجعان داشته باشند.     شما در بیمارستان پیامبران مراقبت های مشترک از یک تیم جامع از متخصصان رشته های مختلف تشخیصی و درمانی دریافت خواهید کرد و هیچ خدمت تشخیصی و درمانی و مراقبتی نیست که در این بیمارستان ارائه نشود.    تمام تلاش ما این است که شما و همراهان شما در بیمارستان پیامبران احساس راحتی کنید و دچار هیچ نگرانی و اضطرابی نشوید. سعی شده است تا حد امکان وسایل رفاهی و خدماتی ممکن در اختیار همراهان و بازدیدکنندگان قرار داشته باشد.     پیشرفت های پزشکی باعث شده که بسیاری از بیماری ها بسیار سریع تشخیص و درمان شوند. در بیمارستان پیامبران ما از نوآورانه ترین دستگاهها و شیوه های درمان استفاده می کنیم.     بیمارستان پیامبران برای رفاه حال بیماران محترم ، طرف قرارداد بیمه های پایه کشور و بیش از 30 شرکت درمانی تکمیلی است.    بیمارستان پیامبران خارج از طرح ترافیک و طرح زوج و فرد قرار دارد و دسترسی به آن به واسطه چندین بزرگراه بسیار آسان است    این بیمارستان دارای پارکینگی در ده طبقه و ظرفیت پذیرش بیش از چهارصد دستگاه خودرو است که امکان استفاده از آن برای مراجعان وجود دارد و این ویژگی در میان تمام بیمارستان های تهران خاص است";
    moreInfo.style.display = "block";
    
    texter(4);
})

options[6].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "رادیولوژی";
    icon.src = "Pics/icons/radiation.png";
    p.innerHTML = "<sub>------</sub>تعرفه های بیمارستان پیامبران کاملا براساس تعرفه های قانونی کشور است و هیچ وجه اضافه ای از بیماران دریافت نمی شود    بیمارستان پیامبران با هدف فراهم آوردن بهترین و با کیفیت ترین خدمات پزشکی با مناسب ترین قیمت احداث شده است و در راستای انجام این رسالت خود را ملزم به ارائه با کیفیت ترین خدمات درمانی می داند.     بیمارستان پیامبران به سلامت روحی و جسمی شما اهمیت می دهد. برای ما آرامش ، آسایش و ایمنی شما مهم است و خود را ملزم به رعایت تمام قوانین و احکام ملی و مذهبی می دانیم .     بیش از یک هزار پزشک در 70 رشته تخصصی و فوق تخصصی به صورت مستقیم با بیمارستان پیامبران همکاری دارند. بیش از سیصد پرستار و مامای با تجربه و بیش از پانصد پرسنل اداری و خدماتی در این بیمارستان گرد هم آمده اند تا بهترین خدمات ممکن را به مراجعان ارائه دهند.    وظیفه ما احترام گذاشتن به شما است . کلیه پرسنل بیمارستان باید بهترین رفتار را با کلیه مراجعان داشته باشند.     شما در بیمارستان پیامبران مراقبت های مشترک از یک تیم جامع از متخصصان رشته های مختلف تشخیصی و درمانی دریافت خواهید کرد و هیچ خدمت تشخیصی و درمانی و مراقبتی نیست که در این بیمارستان ارائه نشود.    تمام تلاش ما این است که شما و همراهان شما در بیمارستان پیامبران احساس راحتی کنید و دچار هیچ نگرانی و اضطرابی نشوید. سعی شده است تا حد امکان وسایل رفاهی و خدماتی ممکن در اختیار همراهان و بازدیدکنندگان قرار داشته باشد.     پیشرفت های پزشکی باعث شده که بسیاری از بیماری ها بسیار سریع تشخیص و درمان شوند. در بیمارستان پیامبران ما از نوآورانه ترین دستگاهها و شیوه های درمان استفاده می کنیم.     بیمارستان پیامبران برای رفاه حال بیماران محترم ، طرف قرارداد بیمه های پایه کشور و بیش از 30 شرکت درمانی تکمیلی است.    بیمارستان پیامبران خارج از طرح ترافیک و طرح زوج و فرد قرار دارد و دسترسی به آن به واسطه چندین بزرگراه بسیار آسان است    این بیمارستان دارای پارکینگی در ده طبقه و ظرفیت پذیرش بیش از چهارصد دستگاه خودرو است که امکان استفاده از آن برای مراجعان وجود دارد و این ویژگی در میان تمام بیمارستان های تهران خاص است";
    moreInfo.style.display = "block";
    
    texter(5);
})

  options[7].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "ارتوپدی";
    icon.src = "Pics/icons/shoulder.png";
    p.innerHTML = "<sub>------</sub>تعرفه های بیمارستان پیامبران کاملا براساس تعرفه های قانونی کشور است و هیچ وجه اضافه ای از بیماران دریافت نمی شود    بیمارستان پیامبران با هدف فراهم آوردن بهترین و با کیفیت ترین خدمات پزشکی با مناسب ترین قیمت احداث شده است و در راستای انجام این رسالت خود را ملزم به ارائه با کیفیت ترین خدمات درمانی می داند.     بیمارستان پیامبران به سلامت روحی و جسمی شما اهمیت می دهد. برای ما آرامش ، آسایش و ایمنی شما مهم است و خود را ملزم به رعایت تمام قوانین و احکام ملی و مذهبی می دانیم .     بیش از یک هزار پزشک در 70 رشته تخصصی و فوق تخصصی به صورت مستقیم با بیمارستان پیامبران همکاری دارند. بیش از سیصد پرستار و مامای با تجربه و بیش از پانصد پرسنل اداری و خدماتی در این بیمارستان گرد هم آمده اند تا بهترین خدمات ممکن را به مراجعان ارائه دهند.    وظیفه ما احترام گذاشتن به شما است . کلیه پرسنل بیمارستان باید بهترین رفتار را با کلیه مراجعان داشته باشند.     شما در بیمارستان پیامبران مراقبت های مشترک از یک تیم جامع از متخصصان رشته های مختلف تشخیصی و درمانی دریافت خواهید کرد و هیچ خدمت تشخیصی و درمانی و مراقبتی نیست که در این بیمارستان ارائه نشود.    تمام تلاش ما این است که شما و همراهان شما در بیمارستان پیامبران احساس راحتی کنید و دچار هیچ نگرانی و اضطرابی نشوید. سعی شده است تا حد امکان وسایل رفاهی و خدماتی ممکن در اختیار همراهان و بازدیدکنندگان قرار داشته باشد.     پیشرفت های پزشکی باعث شده که بسیاری از بیماری ها بسیار سریع تشخیص و درمان شوند. در بیمارستان پیامبران ما از نوآورانه ترین دستگاهها و شیوه های درمان استفاده می کنیم.     بیمارستان پیامبران برای رفاه حال بیماران محترم ، طرف قرارداد بیمه های پایه کشور و بیش از 30 شرکت درمانی تکمیلی است.    بیمارستان پیامبران خارج از طرح ترافیک و طرح زوج و فرد قرار دارد و دسترسی به آن به واسطه چندین بزرگراه بسیار آسان است    این بیمارستان دارای پارکینگی در ده طبقه و ظرفیت پذیرش بیش از چهارصد دستگاه خودرو است که امکان استفاده از آن برای مراجعان وجود دارد و این ویژگی در میان تمام بیمارستان های تهران خاص است";
    moreInfo.style.display = "block";
    
    texter(6);
})

  options[8].addEventListener('click', function () {
    navigator.style.display = "block";
    choosedep.style.display = "none";
    title.innerText = "زنان";
    icon.src = "Pics/icons/woman.png";
    p.innerHTML = "<sub>------</sub>تعرفه های بیمارستان پیامبران کاملا براساس تعرفه های قانونی کشور است و هیچ وجه اضافه ای از بیماران دریافت نمی شود    بیمارستان پیامبران با هدف فراهم آوردن بهترین و با کیفیت ترین خدمات پزشکی با مناسب ترین قیمت احداث شده است و در راستای انجام این رسالت خود را ملزم به ارائه با کیفیت ترین خدمات درمانی می داند.     بیمارستان پیامبران به سلامت روحی و جسمی شما اهمیت می دهد. برای ما آرامش ، آسایش و ایمنی شما مهم است و خود را ملزم به رعایت تمام قوانین و احکام ملی و مذهبی می دانیم .     بیش از یک هزار پزشک در 70 رشته تخصصی و فوق تخصصی به صورت مستقیم با بیمارستان پیامبران همکاری دارند. بیش از سیصد پرستار و مامای با تجربه و بیش از پانصد پرسنل اداری و خدماتی در این بیمارستان گرد هم آمده اند تا بهترین خدمات ممکن را به مراجعان ارائه دهند.    وظیفه ما احترام گذاشتن به شما است . کلیه پرسنل بیمارستان باید بهترین رفتار را با کلیه مراجعان داشته باشند.     شما در بیمارستان پیامبران مراقبت های مشترک از یک تیم جامع از متخصصان رشته های مختلف تشخیصی و درمانی دریافت خواهید کرد و هیچ خدمت تشخیصی و درمانی و مراقبتی نیست که در این بیمارستان ارائه نشود.    تمام تلاش ما این است که شما و همراهان شما در بیمارستان پیامبران احساس راحتی کنید و دچار هیچ نگرانی و اضطرابی نشوید. سعی شده است تا حد امکان وسایل رفاهی و خدماتی ممکن در اختیار همراهان و بازدیدکنندگان قرار داشته باشد.     پیشرفت های پزشکی باعث شده که بسیاری از بیماری ها بسیار سریع تشخیص و درمان شوند. در بیمارستان پیامبران ما از نوآورانه ترین دستگاهها و شیوه های درمان استفاده می کنیم.     بیمارستان پیامبران برای رفاه حال بیماران محترم ، طرف قرارداد بیمه های پایه کشور و بیش از 30 شرکت درمانی تکمیلی است.    بیمارستان پیامبران خارج از طرح ترافیک و طرح زوج و فرد قرار دارد و دسترسی به آن به واسطه چندین بزرگراه بسیار آسان است    این بیمارستان دارای پارکینگی در ده طبقه و ظرفیت پذیرش بیش از چهارصد دستگاه خودرو است که امکان استفاده از آن برای مراجعان وجود دارد و این ویژگی در میان تمام بیمارستان های تهران خاص است";
    moreInfo.style.display = "block";
    
    texter(7);
})



const objects = [
  {
    first: {
      title: "جراحی زیبایی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/plastic-surgury.webp"
    },
    second: {
      title: "C-section",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/C-Section.jpg"
    },
    third: {
      title: "مراقبت",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/plastic-care.jpg"
    },
  },

  {
    first: {
      title: "جراحی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/surgury.jpeg"
    },
    second: {
      title: "عینک",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/glasses.webp"
    },
    third: {
      title: "معاینه",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/visit.webp"
    },
  },

  {
    first: {
      title: "زیبایی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/plastic-care.jpg"
    },
    second: {
      title: "بعد عمل",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/after-care.jpg"
    },
    third: {
      title: "قبل عمل",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/before-care.jpg"
    },
  },

  {
    first: {
      title: "دارو",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/pharmacy.png"
    },
    second: {
      title: "بهداشتی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/sanitary.jpg"
    },
    third: {
      title: "داروسازی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/drugs.jpg"
    },
  },

  {
    first: {
      title: "درمان",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/physio.jpg"
    },
    second: {
      title: "مراقبت",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/physio-care.jpeg"
    },
    third: {
      title: "معاینه",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/physio-visit.jpg"
    },
  },

  {
    first: {
      title: "MRI",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/mri.jpg"
    },
    second: {
      title: "سرپایی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/Radiology.jpg"
    },
    third: {
      title: "دهان و دندان",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/teeth.jpg"
    },
  },

  {
    first: {
      title: "معاینه",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/orthopedic-visit2.jpeg"
    },
    second: {
      title: "فیزیوتراپی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/orthopedic-visit.jpg"
    },
    third: {
      title: "عکس برداری",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/shot.jpg"
    },
  },

  {
    first: {
      title: "زایمان",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/labor.jpg"
    },
    second: {
      title: "نوزاد",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/newborns.jpg"
    },
    third: {
      title: "مراقبت",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/post-birth.jpg"
    },
  },
  
  {
    first: {
      title: "جراحی زیبایی",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/plastic-surgury.webp"
    },
    second: {
      title: "رایج ترین جراحی ها",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/common.png"
    },
    third: {
      title: "مراقبت",
      text: "انجام  جراحی زیبایی از آنجایی که یک روش زیبایی کاملا تهاجمی محسوب می‌شود، ریسک بسیار بالایی دارد و حتما باید زیر نظر پزشک فوق تخصص و در محیطی کاملا پیشرفته و سالم انجام شود.",
      url: "Pics/infopic/plastic-care.jpg"
    },
  }
]

const resCont = document.querySelector('.res-pcont');
const opts = document.querySelector('.options');


window.addEventListener('click', function(e){
	
	if (resCont.contains(e.target)){
  	opts.classList.add("showOn");
  }
  else{
  	opts.classList.remove("showOn");
  }
})

