let date = new Date();
let year = date.getFullYear();
let month = date.getMonth();
let day = date.getDate();

switch(month)
      {
        case 1:
          month="January";
          break;
        case 2:
          month="February";
          break;
        case 3:
          month="March";
          break;
        case 4:
          month="April";
          break;
        case 5:
          month="May";
          break;
        case 6:
          month="June";
          break;
        case 7:
          month="July";
          break;
        case 8:
          month="August";
          break;
        case 9:
          month="September";
          break;
        case 10:
          month="October";
          break;
        case 11:
          month="November";
          break;
        case 12:
          month="December";
          break;
        default:
          month="Invalid month";
      }

let showDate = `${day} / ${month} / ${year}`;

const dateDiv = document.getElementById('date');

dateDiv.innerHTML = showDate;


const infos = [
  {
    name: "دکتر مهری مهراد",
    info: " دکتر زنان کسی است که در مسائل مربوط به دستگاه تناسلی زنان و بارداری تخصص دارد. چنین دکتری می‌تواند بیماری‌ها و مشکلات مربوط به دستگاه تناسلی و تولید مثل زنان را تشخیص دهد و درمان کند."
  },

  {
    name: "دکتر مسعود شیروانی",
    info: "متخصص قلب و عروق (cardiologist) یک تخصص در پزشکی است که با اختلالات قلب و عروق سر و کار دارد. این رشته شامل تشخیص پزشکی و درمان اختلالات مادرزادی قلب، بیماری های عروق کرونر،بیماریهای دریچه ای قلب ،نارسایی قلب و الکتروفیزیولوژی می باشد. دکترمتخصص قلب و عروق کاردیولوژیست هم خوانده می‌شود."
  },

  {
    name: "حامد قدسی",
    info: "متخصص داخلی کیست؟ یک متخصص داخلی که در تمام اندام ها و سیستم های داخلی بدن تخصص دارد. بنابراین دانش و تجربه بالینی این پزشکان در تشخیص، درمان و مراقبت بزرگسالان اگر مشکل پزشکی آزاردهنده ای دارید. و نمی دانید مشکل در کدام اندام یا سیستم است باید به متخصص داخلی مراجعه کنید."
  },

  {
    name: "محسن یزدانیان",
    info: "متخصص مغز و اعصاب را بشناسید : پزشکی است که بیماری‌های مغز، نخاع و اعصاب را تشخیص داده و درمان می‌کند او معمولا بیماری‌ها و اختلالاتی را که بر تفکر و رفتار تأثیر می‌گذارد هم بررسی می‌کند. دکتر مغز و اعصاب جراحی نمی‌کند و صرفا روی درمان بیماری‌هایی تمرکز دارد که نیاز به جراحی ندارند."
  },

  {
    name: "پروفسور توفیق موسیوند",
    info: "دکتر توفیق موسیوند استاد جراحی دانشکده پزشکی اتاوای کانادا و مخترع جهانی نخستین قلب مصنوعی داخل بدن انسان می‌باشد. ایشان در سال ۱۳۱۵در روستای ورکانه همدان چشم به جهان گشود و تا ۱۴ سالگی برای کمک به خانواده چوپانی کرد."
  },

  {
    name: "علی اصغر خدا دوست",
    info: "علی اصغر خدادوست در سال ۱۳۱۴ در شیراز به دنیا آمد. دبستان و دبیرستان را در زادگاه خود گذراند و پس از آن به عنوان آموزگار در دبستان داوری داراب مشغول به کار شد. در سال ۱۳۳۳ در آزمون ورودی دانشکده پزشکی شیراز شرکت کرد و با رتبه ممتاز در بین داوطلبان پذیرفته شد. دوره شش ساله پزشکی را با درجه ممتاز پشت سر گذاشت و پس از یک سال گذراندن دوره دستیاری چشم و گوش و حلق و بینی در بیمارستان نمازی دانشگاه شیراز در سال ۱۳۴۱، از طرف دولت برای گذراندن دوره تخصصی در ایالات متحده برگزیده شد."
  },

  {
    name: "پروفسور مجید سمیعی",
    info: "پروفسور مجید سمیعی درتاریخ  ۲۹ خرداد ۱۳۱۶ در شهر تهران چشم به جهان گشودند.ایشان دوره‌ی دبیرستان را در دبیرستان شاهپور رشت به اتمام رساند و برای ادامه‌ی تحصیل به آلمان رفت. به نقل دکتر سمیعی ایشان در سن ۱۱ سالگی علاقه‌ی بسیار زیادی به جراحی مغز و اعصاب پیدا کرد و به همین دلیل در دانشگاه یوهانس گوتنبرگ در شهر ماینتس به تحصیل در رشته‌های زیست‌شناسی و پزشکی پرداخت. او به دلیل کسب عالی‌ترین نمرات در امتحانات پایان دوره‌ی پزشکی توانست جایزه‌ی ویژه‌ی وزارت علوم ایران برای برترین دانشجویان مقیم اروپا را دریافت کند."
  },

  {
    name: "محمد حسین ماندگار",
    info: "وی موسسه پیوند قلب و ریه بیمارستان دکتر شریعتی است و در تابستان 1372 اولین پیوند موفقیت آمیز قلب در ایران را به نام خود به ثبت رسانید. دکتر ماندگار در حال حاضر استاد جراحی قلب دانشگاه تهران است. ماندگار بخش جراحی قلب بیمارستان دکتر شریعتی تهران را پایه گذاری کرد که بعدها این مرکز دانشگاهی به یکی از پرکارترین و مشهورترین بیمارستان‌های دانشگاهی تهران در رشته جراحی قلب تبدیل شد."
  },

  {
    name: "دکتر باقر شاهوردیانی",
    info: "شادروان دکتر شاهوردیانی در 23 اردیبهشت سال 1303 در مشهد مقدس به دنیا آمد. تحصیلات ابتدایی و متوسطه را در شهر مشهد با موفقیت به پایان رسانید. در سال 1323 به دانشکده دندان پزشکی دانشگاه تهران راه یافت. در سال 1328 موفق به اخذ درجه دکترا شد. پس از شرکت در آزمون دستیاری و احراز رتبه اول، در سال 1329 دوره دستیاری خود را در دانشکده دندان پزشکی دانشگاه تهران آغاز نمود."
  },

  {
    name: "لیدا نمازی",
    info: "پزشکی زنان یا بیماری‌های زنان و زایمان یا گایناکولوژی (Gynaecology یا Gynecology) یکی از رشته‌های تخصصی پزشکی است. البته در کشورهای اروپایی و امریکایی تخصص دیگری به نام Obstetrician هم وجود دارد که وظیفه‌اش مراقبت از خانم‌ها در حین بارداری و کمک به آنها در به دنیا آوردن فرزند است."
  },

  {
    name: "لیلا دلخواه اكبری",
    info: "گاهی هم ممکن است با تخصصی به نام OB-Gyn (با تلفظ اُ بی جین) مواجه شوید. منظور از OB-Gyn همان چیزی است که در ایران با نام «دکتر زنان و زایمان» شناخته می‌شود. این دکترها هم برای مراقبت از سلامتی زنان تلاش می‌کنندو هم درباره بارداری و زایمان به خانم‌ها کمک می‌کنند."
  },

  {
    name: "نیما محسنی",
    info: "تعدادی از دکترهای زنان ترجیح می‌دهند فقط در یکی از این رشته‌ها کار کنند و وارد رشته‌ی دیگر نشوند. مثلا عده‌ای از دکترهای زنان تعداد در مسائل بهداشتی زنان ورود می‌کنند و کاری به حاملگی و زایمان ندارند. حتی ممکن است تعدادی از دکترهای زنان و زایمان که در بخش زایمان تخصص دارند، ترجیح بدهند فقط در زایمان طبیعی حضور داشته باشند و در جراحی‌هایی مثل سزارین دخالت نکنند."
  },

  {
    name: "دنیا افشارچی",
    info: "واژه «دُکتُر» (doctor) با نماد M.D. کوتاه و ساده شده واژه «دکترِ پزشکی» (doctor of medicine) است که به کسی گویند که به درجه «دکترای پزشکی» (doctorate of medicine) رسیده باشد."
  },

  {
    name: "فاطمه نیك پور",
    info: "در مراکز درمانی مسئول درمان بیمار هشیار پزشک معالج به انتخاب خود او یا ولی او (برای بیمار محجور مانند کودک) است. اعضاء تیم درمانی مانند پرستار، بهیار ، ماما، کاردان بیهوشی، کاردان اتاق عمل و... همه برای بهبود بیمار تلاش می‌کنند. کارکنان آزمایشگاه‌ها و مرکز پیراپزشکی و مؤسسه‌ها تصویربرداری پزشکی نیز اعضاء تیم درمان هستند."
  },

  {
    name: "بیتا هرمز",
    info: "به عنوان یک قاعده، هر درمانی علائم و منع مصرف دارد. انواع مختلف درمانی وجود دارد. همه روش‌های درمانی مؤثر و دارای اثر درمانی نیستند. بسیاری از روش‌های درمانی می‌توانند عوارض جانبی ناخواسته ایجاد کنند."
  }
]

let name = document.querySelector('.doc-info h1');
let image = document.querySelector('.top-symbol img');
let info = document.querySelector('.doc-info p');
let pics = document.querySelectorAll('.doctors img');
let contacts = document.querySelector('.contact');
const docDiv = document.querySelectorAll('.doctors > a');

let width = window.screen.width;


function infoshow(index) {
  name.innerText = infos[index].name;
  info.innerText = infos[index].info;
  image.src = pics[index].src;
  contacts.style.display = "flex";
  image.style.borderRadius = "40px";
  image.style.width = "22vw";
  info.style.fontSize = "14px";
  if (width <= 500) {
    docDiv[index].href = "#down";
  }
}

