let date = new Date();
let year = date.getFullYear();
let month = date.getMonth();
let day = date.getDate();

switch(month)
      {
        case 1:
          month="January";
          break;
        case 2:
          month="February";
          break;
        case 3:
          month="March";
          break;
        case 4:
          month="April";
          break;
        case 5:
          month="May";
          break;
        case 6:
          month="June";
          break;
        case 7:
          month="July";
          break;
        case 8:
          month="August";
          break;
        case 9:
          month="September";
          break;
        case 10:
          month="October";
          break;
        case 11:
          month="November";
          break;
        case 12:
          month="December";
          break;
        default:
          month="Invalid month";
      }

let showDate = `${day} / ${month} / ${year}`;

const dateDiv = document.getElementById('date');

dateDiv.innerHTML = showDate;


const hotels = [
    {
        name: "هتل پارتیا گرگان",
        text: "مجموعه چند منظوره پارتیا گرگان با کاربری تجاری، تفریحی، اقامتی یکی از بهترین های کشور از نظر زیبایی و تجهیزات و از بزرگترین های شمال کشور است. احداث این مجموعه در خیابان ناهار خوران گرگان که معروفترین منطقه این شهر می‌باشد، توجه بسیاری را به خود جلب خواهد کرد.",
        url:  "Pics/hotel-intro/intro1.webp",
        href: "#",
        table: ["35$", "دارد", "ندارد", "دارد", "دریا"]
    },

    {
        name: "هتل شهاب ناهارخوران گرگان",
        text: "هتل شهاب ناهار خوران گرگان در سال ۱۳۹۲ در ۴ طبقه و ۴۳ واحد اقامتی در یکی از بهترین مناطق گرگان مورد بهره برداری قرار گرفت. نزدیگی این هتل به جنگل‌های حفاظت شده و زیبای گرگان فضای مناسبی را برای علاقه مندان به طبیعت ایجاد کرده است. همچنین این هتل با بهره گیری از امکانات رفاهی و خدمات ویژه با کادری مجرب و آموزش دیده آماده ی پذیرایی از میهمانان گرامی در تمام فصول می‌باشد.",
        url:  "Pics/hotel-intro/intro2.jpg",
        href: "#",
        table: ["33$", "دارد", "ندارد", "دارد", "کویر"]
    },

    {
        name: "هتل آپارتمان گل نرگس گرگان",
        text: "هتل گل نرگس در سال ۱۳۹۵ افتتاح و در نزدیکی مرکز شهر گرگان واقع گردیده است. موقعیت مکانی مناسب هتل و دسترسی آسان مهمانان به مقاصد گردشگری شهر گرگان از جمله پارک جنگلی نهارخوران، کاخ موزه گرگان، مسجد جامع، بازار نعلبندان، پارک جنگلی النگدره و منطقه جنگلی ناهارخوران از امتیازات این هتل می‌باشد. این هتل در ۶ طبقه و ۲۳ واحد آماده میزبانی از میهمانان گرامی می‌باشد.",
        url:  "Pics/hotel-intro/intro3.jpg",
        href: "#",
        table: ["15$", "دارد", "دارد", "ندارد", "دریا"]
    },

    {
        name: "هتل بوتانیک گرگان",
        text: "این هتل مجلل 5 ستاره در یک باغ 4 هکتاری با امکانات منحصر بفرد دارای سالن های ورزش برای خانم ها و آقایان بطور جداگانه هر کدام شامل استخر ، سونای خشک و بخار ، جکوزی ، سالن ماساز و آرایش می باشد .",
        url:  "Pics/hotel-intro/intro4.jpg",
        href: "#",
        table: ["75$", "دارد", "دارد", "دارد", "دریا"]
    },

    {
        name: "هتل جهانگردی ناهارخوران گرگان",
        text: "هتل جهانگردی ناهارخوران در سال ۱۳۵۴ افتتاح و جهت ارتقا کیفیت خدمات در سال ۱۳۸۹ بازسازی انجام داده است. این هتل در بلوار ناهارخوران گرگان در دل جنگل های هیرکانی و فاصله ۸ کیلومتری از مرکز شهر واقع شده است. از مزایای این مجموعه می‌توان به دسترسی آسان به پارک جنگلی النگدره و روستای توریستی زیارت اشاره نمود. هتل جهانگردی در ۳ طبقه و ۱۵۰ باب اتاق، کلبه و سوئیت با دارا بودن کادر مجرب و آموزش دیده پذیرای شما میهمانان عزیز می‌باشد.",
        url:  "Pics/hotel-intro/intro5.jpg",
        href: "#",
        table: ["15$", "ندارد", "دارد", "ندارد", "دریا"]
    },

    {
        name: "هتل زیارت گرگان",
        text: "هتل زیارت با مساحت ۲۰۰۰ متر مربع در روستای خوش آب و هوای زیارت در انتهای جاده زیبا و خاطر انگیز ناهار خوران گرگان واقع شده است. روستای زیارت به دلیل وجود آب و هوایی روح انگیز موجب جذابیت بیشتر این هتل شده است. از امتیازات این هتل اتاق های رو به مناظر زیبای طبیعی و امکان گشت های تفریحی می باشد. این هتل با کارکنان مجرب آماده پذیرایی از شما مهمانان گرامی می باشند تا اقامتی خاطره انگیز را برایتان رقم بزنند.",
        url:  "Pics/hotel-intro/intro6.jpg",
        href: "#",
        table: ["45$", "دارد", "ندارد", "ندارد", "جنگل"]
    },

    {
        name: "مرکز آموزشی رفاهی فرهنگیان",
        text: "زمین این بنا از باب ثلث سهم مرحوم حاج یحیی دارویی توسط حضرت آیت الله سید ضیاالدین استرآبادی امام جماعت مسجد جامع تهران جهت استفاده فرهنگیان به آموزش و پرورش اهدا گردید. عملیات احداث این بنای آموزشی و رفاهی از مهر ماه سال ١٣٧٨ آغاز و در اردیبهشت ماه سال ١٣٨٠ همزمان با سالروز شهادت استاد مرتضی مطهری و هفته بزرگداشت مقام والای معلم، باحضور جناب آقای مظفری وزیر محترم آموزش و پرورش افتتاح گردید.",
        url:  "Pics/hotel-intro/intro7.jpg",
        href: "#",
        table: ["29$", "ندارد", "ندارد", "ندارد", "جنگل"]
    },

    {
        name: "هتل بین المللی آذین",
        text: "هتل بین المللی آذین اولین هتل 4 ستاره استانداردسازی شده در استان سرسبز گلستان و در شهرستان زیبای گرگان و در مسیر جاده تهران گرگان و مدخل ورودی شهر قرار دارد . این هتل از شمال به دشت زیبای ترکمن و از جنوب به کوهها و جنگل سرسبز گلستان و از غرب به دشت زیبای ترکمن و جاده تهران گرگان و از شرق به شهر گرگان مشرف می باشد.",
        url:  "Pics/hotel-intro/intro8.jfif",
        href: "#",
        table: ["18$", "دارد", "دارد", "ندارد", "دریا"]
    }
]

const img = document.querySelector('.hotel-info img');
const a = document.querySelector('.book');
const a2 = document.querySelector('.book2');
const p = document.querySelector('.hotel-info p');
const h1 = document.querySelector('.hotel-name');
const detail = document.querySelector('.details');

function hotel(i) {
    img.style.display = "inline";
    img.src = hotels[i].url;
    a.style.display = "block";
    a2.style.display = "block";
    detail.style.display = "block";
    a.href = hotels[i].href;
    h1.innerText = hotels[i].name;
    p.innerText = hotels[i].text;
    detailer(i);
}

const td = document.querySelectorAll('td');

function detailer(i) {
  for (let j = 0; j < hotels[i].table.length; j++){
    td[j].innerText = hotels[i].table[j];
  }
}